loadtest_jmeter/jmeter.log
2025-07-03 16:25:31,184 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2025-07-03 16:25:31,206 INFO o.a.j.JMeter: Loading user properties from: /Users/zhanglei/apache-jmeter-5.6.2/bin/user.properties
2025-07-03 16:25:31,207 INFO o.a.j.JMeter: Loading system properties from: /Users/zhanglei/apache-jmeter-5.6.2/bin/system.properties
2025-07-03 16:25:31,210 INFO o.a.j.JMeter: Copyright (c) 1998-2023 The Apache Software Foundation
2025-07-03 16:25:31,210 INFO o.a.j.JMeter: Version 5.6.2
2025-07-03 16:25:31,210 INFO o.a.j.JMeter: java.version=22.0.2
2025-07-03 16:25:31,210 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-07-03 16:25:31,210 INFO o.a.j.JMeter: os.name=Mac OS X
2025-07-03 16:25:31,210 INFO o.a.j.JMeter: os.arch=aarch64
2025-07-03 16:25:31,211 INFO o.a.j.JMeter: os.version=15.5
2025-07-03 16:25:31,211 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-03 16:25:31,211 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-03 16:25:31,211 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-03 16:25:31,211 INFO o.a.j.JMeter: Available Processors =8
2025-07-03 16:25:31,217 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-03 16:25:31,217 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2025-07-03 16:25:31,217 INFO o.a.j.JMeter: JMeterHome=/Users/zhanglei/apache-jmeter-5.6.2
2025-07-03 16:25:31,217 INFO o.a.j.JMeter: user.dir  =/Users/zhanglei/git/dv_project/loadtest_jmeter
2025-07-03 16:25:31,217 INFO o.a.j.JMeter: PWD       =/Users/zhanglei/git/dv_project/loadtest_jmeter
2025-07-03 16:25:31,219 INFO o.a.j.JMeter: IP: 192.168.1.24 Name: RayMP.local FullName: 192.168.1.24
2025-07-03 16:25:31,227 INFO o.a.j.s.FileServer: Default base='/Users/zhanglei/git/dv_project/loadtest_jmeter'
2025-07-03 16:25:31,228 INFO o.a.j.s.FileServer: Set new base='/Users/zhanglei/git/dv_project/loadtest_jmeter'
2025-07-03 16:25:31,322 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-03 16:25:31,346 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-03 16:25:31,348 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-03 16:25:31,349 INFO o.a.j.s.SaveService: Loading file: TestPlan.jmx
2025-07-03 16:25:31,386 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-03 16:25:31,386 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-03 16:25:31,386 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-03 16:25:31,386 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-03 16:25:31,386 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-03 16:25:31,386 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-03 16:25:31,399 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-03 16:25:31,406 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-03 16:25:31,406 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-03 16:25:31,406 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-03 16:25:31,409 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-03 16:25:31,409 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-03 16:25:31,445 INFO o.a.j.JMeter: 正在运行的测试 (1751527531445)
2025-07-03 16:25:31,460 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-07-03 16:25:31,460 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Thread Group.
2025-07-03 16:25:31,460 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-03 16:25:31,460 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=1 delayedStart=false
2025-07-03 16:25:31,465 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-07-03 16:25:31,465 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-03 16:25:31,465 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-03 16:25:31,475 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = RayMP.local
2025-07-03 16:25:31,478 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-07-03 16:25:31,478 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-07-03 16:25:31,478 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-07-03 16:25:31,478 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-07-03 16:25:31,478 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-07-03 16:25:31,567 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2025-07-03 16:25:31,635 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    5.3/s Avg:   119 Min:   119 Max:   119 Err:     0 (0.00%) Active: 2 Started: 2 Finished: 0
2025-07-03 16:25:31,667 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2025-07-03 16:25:31,764 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2025-07-03 16:25:31,864 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2025-07-03 16:25:31,966 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-6
2025-07-03 16:25:32,065 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-7
2025-07-03 16:25:32,162 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-8
2025-07-03 16:25:32,266 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-9
2025-07-03 16:25:32,365 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-10
2025-07-03 16:26:00,036 INFO o.a.j.r.Summariser: summary +    875 in 00:00:28 =   30.8/s Avg:   319 Min:    94 Max:   699 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2025-07-03 16:26:00,037 INFO o.a.j.r.Summariser: summary =    876 in 00:00:29 =   30.6/s Avg:   319 Min:    94 Max:   699 Err:     0 (0.00%)
2025-07-03 16:26:02,633 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-10
2025-07-03 16:26:02,633 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-10
2025-07-03 16:26:02,674 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-07-03 16:26:02,675 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-07-03 16:26:03,223 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2025-07-03 16:26:03,224 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2025-07-03 16:26:03,255 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-4
2025-07-03 16:26:03,256 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2025-07-03 16:26:03,322 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-5
2025-07-03 16:26:03,322 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2025-07-03 16:26:03,475 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-7
2025-07-03 16:26:03,475 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-7
2025-07-03 16:26:03,516 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-6
2025-07-03 16:26:03,516 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-6
2025-07-03 16:26:03,561 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2025-07-03 16:26:03,561 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2025-07-03 16:26:03,857 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-9
2025-07-03 16:26:03,857 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-9
2025-07-03 16:26:04,058 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-8
2025-07-03 16:26:04,059 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-8
2025-07-03 16:26:04,059 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-03 16:26:04,060 INFO o.a.j.r.Summariser: summary +    124 in 00:00:04 =   30.8/s Avg:   277 Min:    39 Max:   635 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2025-07-03 16:26:04,060 INFO o.a.j.r.Summariser: summary =   1000 in 00:00:33 =   30.7/s Avg:   313 Min:    39 Max:   699 Err:     0 (0.00%)